Haley212/SMEC_PMSM/User/F28335BSP.c
/*
 * F28335BSP.c
 *
 *  Created on: 2013-3-19
 *      Author: appleseed
 */
#include "F28335BSP.h"
#include "Printf_sci.h"
#include "Menu.h"

unsigned char SCIRxBuffer[32];
unsigned char SCIRxBufferIndex = 0;

void ConfigureAllGPIO(void)
{
   EALLOW;

   //------------------EPWM Section---------------------//

    /*GpioCtrlRegs.GPAPUD.bit.GPIO0 = 1;   // Disable pullup on GPIO0
    GpioCtrlRegs.GPAPUD.bit.GPIO1 = 1;   // Disable pullup on GPIO1
    GpioCtrlRegs.GPAPUD.bit.GPIO2 = 1;   // Disable pullup on GPIO2
    GpioCtrlRegs.GPAPUD.bit.GPIO3 = 1;   // Disable pullup on GPIO3
    GpioCtrlRegs.GPAPUD.bit.GPIO4 = 1;   // Disable pullup on GPIO4
    GpioCtrlRegs.GPAPUD.bit.GPIO5 = 1;   // Disable pullup on GPIO5

    GpioCtrlRegs.GPAMUX1.bit.GPIO0 = 1;  // GPIO0 = PWM1A
    GpioCtrlRegs.GPAMUX1.bit.GPIO1 = 1;  // GPIO1 = PWM1B
    GpioCtrlRegs.GPAMUX1.bit.GPIO2 = 1;  // GPIO2 = PWM2A
    GpioCtrlRegs.GPAMUX1.bit.GPIO3 = 1;  // GPIO3 = PWM2B
    GpioCtrlRegs.GPAMUX1.bit.GPIO4 = 1;  // GPIO4 = PWM3A
    GpioCtrlRegs.GPAMUX1.bit.GPIO5 = 1;  // GPIO5 = PWM3B

    GpioCtrlRegs.GPAPUD.bit.GPIO6 = 1;   // Disable pullup on GPIO6
    GpioCtrlRegs.GPAPUD.bit.GPIO7 = 1;   // Disable pullup on GPIO7
    GpioCtrlRegs.GPAPUD.bit.GPIO8 = 1;   // Disable pullup on GPIO8
    GpioCtrlRegs.GPAPUD.bit.GPIO9 = 1;   // Disable pullup on GPIO9
    GpioCtrlRegs.GPAPUD.bit.GPIO10 = 1;   // Disable pullup on GPIO10
    GpioCtrlRegs.GPAPUD.bit.GPIO11 = 1;   // Disable pullup on GPIO11

    GpioCtrlRegs.GPAMUX1.bit.GPIO6 = 1;  // GPIO6 = PWM4A
    GpioCtrlRegs.GPAMUX1.bit.GPIO7 = 1;  // GPIO7 = PWM4B
    GpioCtrlRegs.GPAMUX1.bit.GPIO8 = 1;  // GPIO8 = PWM5A
    GpioCtrlRegs.GPAMUX1.bit.GPIO9 = 1;  // GPIO9 = PWM5B
    GpioCtrlRegs.GPAMUX1.bit.GPIO10 = 1;  // GPIO10 = PWM6A
    GpioCtrlRegs.GPAMUX1.bit.GPIO11 = 1;  // GPIO11 = PWM6B

   //Trip Zone Hardware protection
    GpioCtrlRegs.GPAPUD.bit.GPIO12 = 0;   // Enable pullup on GPIO12 TZ1
    GpioCtrlRegs.GPAPUD.bit.GPIO13 = 0;   // Enable pullup on GPIO13 TZ2
    GpioCtrlRegs.GPAPUD.bit.GPIO14 = 0;   // Enable pullup on GPIO14 TZ3
    GpioCtrlRegs.GPAPUD.bit.GPIO15 = 0;   // Enable pullup on GPIO15 TZ4
    GpioCtrlRegs.GPAPUD.bit.GPIO16 = 0;   // Enable pullup on GPIO16 TZ5
    GpioCtrlRegs.GPAPUD.bit.GPIO17 = 0;	  // Enable pullup on GPIO17 TZ6


    GpioCtrlRegs.GPAMUX1.bit.GPIO12 = 1;  // GPIO12 = TZ1
    GpioCtrlRegs.GPAMUX1.bit.GPIO13 = 1;  // GPIO13 = TZ2
    GpioCtrlRegs.GPAMUX1.bit.GPIO14 = 1;  // GPIO14 = TZ3
    GpioCtrlRegs.GPAMUX1.bit.GPIO15 = 1;  // GPIO15 = TZ4
    GpioCtrlRegs.GPAMUX2.bit.GPIO16 = 3;  // GPIO16 = TZ5
    GpioCtrlRegs.GPAMUX2.bit.GPIO17 = 3;  // GPIO17 = TZ6

    GpioCtrlRegs.GPAQSEL1.bit.GPIO12 = 2; // 6个采样点才能触发TZ的改变
	GpioCtrlRegs.GPAQSEL1.bit.GPIO13 = 2; // 6个采样点才能触发TZ的改变
	GpioCtrlRegs.GPAQSEL1.bit.GPIO14 = 2; // 6个采样点才能触发TZ的改变
	GpioCtrlRegs.GPAQSEL1.bit.GPIO15 = 2; // 6个采样点才能触发TZ的改变
	GpioCtrlRegs.GPAQSEL2.bit.GPIO16 = 2; // 6个采样点才能触发TZ的改变
	GpioCtrlRegs.GPAQSEL2.bit.GPIO17 = 2; // 6个采样点才能触发TZ的改变
*/
 //------------------EPWM END--------------------//


 //------------------FPGA PROG_B Section---------------------//
 	GpioCtrlRegs.GPBPUD.bit.GPIO61 = 1;			//GPIO61 configs as GPIO Disable PUD
 	GpioCtrlRegs.GPBMUX2.bit.GPIO61 = 0;
 	GpioCtrlRegs.GPBDIR.bit.GPIO61 = 1;         // GPIO61 = OUTPUT;
 	GpioDataRegs.GPBDAT.bit.GPIO61 = 0;			//FPGA RESET = 0, START = 1

 	GpioCtrlRegs.GPBPUD.bit.GPIO34  = 0;		// ENABLE pud
 	GpioCtrlRegs.GPBMUX1.bit.GPIO34 = 0;		// GPIO34
 	GpioCtrlRegs.GPBDIR.bit.GPIO34  = 1;		// output
 	GpioDataRegs.GPBSET.bit.GPIO34  = 1;		// high = software reset low = fpga start

 	GpioCtrlRegs.GPBPUD.bit.GPIO59  = 0;		// enable pullup
 	GpioCtrlRegs.GPBMUX2.bit.GPIO59 = 0;		// CCLK
 	GpioCtrlRegs.GPBDIR.bit.GPIO59  = 1;		// out
 	GpioDataRegs.GPBSET.bit.GPIO59  = 1;		// 1

 	GpioCtrlRegs.GPBPUD.bit.GPIO60  = 0;		// enable pullup
 	GpioCtrlRegs.GPBMUX2.bit.GPIO60 = 0;		// DOUT
 	GpioCtrlRegs.GPBDIR.bit.GPIO60  = 1;		// out
 	GpioDataRegs.GPBSET.bit.GPIO60  = 1;		// 1

 //------------------FPGA PROG_B END-----------------//



  //------------------ECAN Section--------------------//
/*
	GpioCtrlRegs.GPAPUD.bit.GPIO18 = 0;	    // Enable pull-up for GPIO18 (CANRXA)
  	GpioCtrlRegs.GPAPUD.bit.GPIO19 = 0;	    // Enable pull-up for GPIO19 (CANTXA)
    GpioCtrlRegs.GPAQSEL2.bit.GPIO18 = 3;	// Async input
  	GpioCtrlRegs.GPAMUX2.bit.GPIO18 = 3;	// Configure GPIO18 for CANRXA operation
	GpioCtrlRegs.GPAMUX2.bit.GPIO19 = 3;	// Configure GPIO19 for CANTXA operation
*/
  //-------------------ECAN END-----------------------//



 //------------------I2C Section--------------------//
 /*
 	GpioCtrlRegs.GPBPUD.bit.GPIO32 = 0;
 	GpioCtrlRegs.GPBPUD.bit.GPIO33 = 0;
 	GpioCtrlRegs.GPBQSEL1.bit.GPIO32 = 3;       //Asynchonous input
 	GpioCtrlRegs.GPBQSEL1.bit.GPIO33 = 3;       //Asynchonous input
 	GpioCtrlRegs.GPBMUX1.bit.GPIO32 = 1;		//GPIO32 configs as I2C SDA
 	GpioCtrlRegs.GPBMUX1.bit.GPIO33 = 1;		// I2C SCL
 */
 //-------------------I2C END-----------------------//

 //------------------XINTF Section---------------------//
 //--			地址线上的上拉电阻均使能			--
// 	GpioCtrlRegs.GPAPUD.bit.GPIO28 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPAMUX2.bit.GPIO28 = 2;    //Configs as XZCS6
// 	GpioCtrlRegs.GPBPUD.bit.GPIO35 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO35 = 2;    //Configs as XR/W
// 	GpioCtrlRegs.GPBPUD.bit.GPIO36 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO36 = 2;	//Configs as DXZCS0
// 	GpioCtrlRegs.GPBPUD.bit.GPIO37 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO37 = 2;	//Configs as DXZCS7
// 	GpioCtrlRegs.GPBPUD.bit.GPIO38 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO38 = 2;	//Configs as XWE0

// 	GpioCtrlRegs.GPBPUD.bit.GPIO40 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO40 = 2;	//Configs as XA0
// 	GpioCtrlRegs.GPBPUD.bit.GPIO41 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO41 = 2;	//Configs as XA1
// 	GpioCtrlRegs.GPBPUD.bit.GPIO42 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO42 = 2;	//Configs as XA2
// 	GpioCtrlRegs.GPBPUD.bit.GPIO43 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO43 = 2;	//Configs as XA3
// 	GpioCtrlRegs.GPBPUD.bit.GPIO44 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO44 = 2;	//Configs as XA4
// 	GpioCtrlRegs.GPBPUD.bit.GPIO45 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO45 = 2;	//Configs as XA5
// 	GpioCtrlRegs.GPBPUD.bit.GPIO46 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO46 = 2;	//Configs as XA6
// 	GpioCtrlRegs.GPBPUD.bit.GPIO47 = 0;		//Enable Pull up
 	GpioCtrlRegs.GPBMUX1.bit.GPIO47 = 2;	//Configs as XA7


 	GpioCtrlRegs.GPCMUX1.bit.GPIO64 = 3;  // XD15
    GpioCtrlRegs.GPCMUX1.bit.GPIO65 = 3;  // XD14
    GpioCtrlRegs.GPCMUX1.bit.GPIO66 = 3;  // XD13
    GpioCtrlRegs.GPCMUX1.bit.GPIO67 = 3;  // XD12
    GpioCtrlRegs.GPCMUX1.bit.GPIO68 = 3;  // XD11
    GpioCtrlRegs.GPCMUX1.bit.GPIO69 = 3;  // XD10
    GpioCtrlRegs.GPCMUX1.bit.GPIO70 = 3;  // XD19
    GpioCtrlRegs.GPCMUX1.bit.GPIO71 = 3;  // XD8
    GpioCtrlRegs.GPCMUX1.bit.GPIO72 = 3;  // XD7
    GpioCtrlRegs.GPCMUX1.bit.GPIO73 = 3;  // XD6
    GpioCtrlRegs.GPCMUX1.bit.GPIO74 = 3;  // XD5
    GpioCtrlRegs.GPCMUX1.bit.GPIO75 = 3;  // XD4
    GpioCtrlRegs.GPCMUX1.bit.GPIO76 = 3;  // XD3
    GpioCtrlRegs.GPCMUX1.bit.GPIO77 = 3;  // XD2
    GpioCtrlRegs.GPCMUX1.bit.GPIO78 = 3;  // XD1
    GpioCtrlRegs.GPCMUX1.bit.GPIO79 = 3;  // XD0


