Haley212/SMEC_PMSM/User/F28335BSP.c
 //------------------XINTF END-----------------//

/****************FPGA IO Communication***************/
    //GPIO16连接PWM_Enable，高电平使能，低电平禁止
    GpioCtrlRegs.GPAMUX2.bit.GPIO16 = 0;
    GpioCtrlRegs.GPADIR.bit.GPIO16 = 1;//output
    GpioDataRegs.GPACLEAR.bit.GPIO16 = 1;

    //GPIO17连接PWM_Update，高电平刷新，低电平不刷新，常态是高电平
    GpioCtrlRegs.GPAMUX2.bit.GPIO17 = 0;
    GpioCtrlRegs.GPADIR.bit.GPIO17 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO17 = 1;

    //GPIO27,PWM Shutdown, 低电平闭锁
    GpioCtrlRegs.GPAMUX2.bit.GPIO27 = 0;
    GpioCtrlRegs.GPADIR.bit.GPIO27 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO27 = 1;

/****************FPGA IO Communication***************/

 //-------------------SCI SECTION-------------//
 /*	GpioCtrlRegs.GPBPUD.bit.GPIO62 = 0;    // Enable pull-up for GPIO62 (SCIRXDC)
	GpioCtrlRegs.GPBPUD.bit.GPIO63 = 0;	   // Enable pull-up for GPIO63 (SCITXDC)
	GpioCtrlRegs.GPBQSEL2.bit.GPIO62 = 3;  // Asynch input GPIO62 (SCIRXDC)
	GpioCtrlRegs.GPBMUX2.bit.GPIO62 = 1;   // Configure GPIO62 for SCIRXDC operation
	GpioCtrlRegs.GPBMUX2.bit.GPIO63 = 1;   // Configure GPIO63 for SCITXDC operation

	GpioCtrlRegs.GPAPUD.bit.GPIO22 = 0;	   // Enable pull-up for GPIO22 (SCITXDB)
    GpioCtrlRegs.GPAPUD.bit.GPIO23 = 0;	   // Enable pull-up for GPIO23 (SCIRXDB)
	GpioCtrlRegs.GPAQSEL2.bit.GPIO23 = 3;  // Asynch input GPIO23 (SCIRXDB)
	GpioCtrlRegs.GPAMUX2.bit.GPIO22 = 3;   // Configure GPIO22 for SCITXDB operation
    GpioCtrlRegs.GPAMUX2.bit.GPIO23 = 3;   // Configure GPIO23 for SCIRXDB operation

    GpioCtrlRegs.GPAMUX2.bit.GPIO21 = 0;	// Gpio21 as RS485-TX_ENABLE
    GpioCtrlRegs.GPADIR.bit.GPIO21 = 1;		// Output TX ENABLE 485
    GpioCtrlRegs.GPAPUD.bit.GPIO21 = 1;		// Disable
    GpioDataRegs.GPACLEAR.bit.GPIO21 = 1;	// Output = low Recieve Enable
*/
 //-------------------SCI END-----------------//

 //------------------SPI SECTION-------------//
 //   GpioCtrlRegs.GPBPUD.bit.GPIO54 = 1;
 //   GpioCtrlRegs.GPBPUD.bit.GPIO56 = 1;
 //   GpioCtrlRegs.GPBPUD.bit.GPIO57 = 1;

 //   GpioCtrlRegs.GPBMUX2.bit.GPIO54 = 1;
 //   GpioCtrlRegs.GPBMUX2.bit.GPIO56 = 1;
 //   GpioCtrlRegs.GPBMUX2.bit.GPIO57 = 1;

 //-------------------SPI END-----------------//

 //-------------------GPIO SECTION------------//

 // 拨码开关部分
 	GpioCtrlRegs.GPCPUD.bit.GPIO80 = 0;		// Enable Pullup
 	GpioCtrlRegs.GPCPUD.bit.GPIO81 = 0;		// Enable Pullup
 	GpioCtrlRegs.GPCPUD.bit.GPIO82 = 0;		// Enable Pullup
 	GpioCtrlRegs.GPCPUD.bit.GPIO83 = 0;		// Enable Pullup

 	GpioCtrlRegs.GPCMUX2.bit.GPIO80 = 3;	// XA8 as gpio
 	GpioCtrlRegs.GPCMUX2.bit.GPIO81 = 3;	// XA9 as gpio
 	GpioCtrlRegs.GPCMUX2.bit.GPIO82 = 3;	// XA10 as gpio
	GpioCtrlRegs.GPCMUX2.bit.GPIO83 = 3;	// XA11 as gpio

	GpioCtrlRegs.GPCDIR.bit.GPIO80 = 0;		// input DSPSW1.4
	GpioCtrlRegs.GPCDIR.bit.GPIO81 = 0;		// input DSPSW1.3
	GpioCtrlRegs.GPCDIR.bit.GPIO82 = 0;		// input DSPSW1.2
	GpioCtrlRegs.GPCDIR.bit.GPIO83 = 0;		// input DSPSW1.1

	GpioCtrlRegs.GPAPUD.bit.GPIO20 = 0;		// Enable PU
	GpioCtrlRegs.GPAPUD.bit.GPIO24 = 0;		// Enable PU
 	GpioCtrlRegs.GPAPUD.bit.GPIO25 = 0;		// Enable PU

 	GpioCtrlRegs.GPAMUX2.bit.GPIO20 = 0;	// GPIO
 	GpioCtrlRegs.GPAMUX2.bit.GPIO24 = 0;	// GPIO
 	GpioCtrlRegs.GPAMUX2.bit.GPIO25 = 0;	// GPIO

 	GpioCtrlRegs.GPADIR.bit.GPIO20 = 0;		// input DSPSW2.1
 	GpioCtrlRegs.GPADIR.bit.GPIO24 = 0;		// input DSPSW2.2
 	GpioCtrlRegs.GPADIR.bit.GPIO25 = 0;		// input DSPSW2.3

 //----------------GPIO END----------------------//

 //------------------LED SECTION-----------------//
	GpioCtrlRegs.GPBPUD.bit.GPIO39 = 1;				// disable
	GpioCtrlRegs.GPAPUD.bit.GPIO30 = 1; 			// disable
	GpioCtrlRegs.GPAPUD.bit.GPIO31 = 1; 			// disable

	GpioCtrlRegs.GPAMUX2.bit.GPIO30 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO30 = 1;          //GPIO30 = OUTPUT
	GpioDataRegs.GPASET.bit.GPIO30 = 1;
	GpioCtrlRegs.GPAMUX2.bit.GPIO31 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO31 = 1;          //GPIO31 = OUTPUT
	GpioDataRegs.GPASET.bit.GPIO31 = 1;
	GpioCtrlRegs.GPBMUX1.bit.GPIO39 = 0;
	GpioCtrlRegs.GPBDIR.bit.GPIO39 = 1;          //GPIO39 = OUTPUT
	GpioDataRegs.GPBSET.bit.GPIO39 = 1;


 //------------------LED END------------------//


//-------------------FAN GOIO-----------------//
	GpioCtrlRegs.GPAMUX1.bit.GPIO8 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO8 = 1;
	GpioDataRegs.GPASET.bit.GPIO8 = 1;

	GpioCtrlRegs.GPAMUX1.bit.GPIO9 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO9 = 1;
	GpioDataRegs.GPASET.bit.GPIO9 = 1;

	GpioCtrlRegs.GPAMUX1.bit.GPIO10 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO10 = 1;
	GpioDataRegs.GPASET.bit.GPIO10 = 1;

	GpioCtrlRegs.GPAMUX1.bit.GPIO11 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO11 = 1;
	GpioDataRegs.GPASET.bit.GPIO11 = 1;
//-------------------FAN END------------------//

//------------PWM Enable Section--------------//
	GpioCtrlRegs.GPAMUX1.bit.GPIO4 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO4 = 1;
	IPWM_DISABLE;

	GpioCtrlRegs.GPAMUX1.bit.GPIO6 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO6 = 1;
	RPWM_DISABLE;
//-------------------END----------------------//

//-------------Relays Enable------------------//
	GpioCtrlRegs.GPAMUX1.bit.GPIO5 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO5 = 1;
	MR_DISABLE;

	GpioCtrlRegs.GPAMUX1.bit.GPIO7 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO7 = 1;
	CR_DISABLE;
//-----------------END------------------------//

//----------------Encoder---------------------//
	GpioCtrlRegs.GPBMUX2.bit.GPIO52 = 0;	//GPIO52 -> F0
	GpioCtrlRegs.GPBDIR.bit.GPIO52 = 0;		//Input

	GpioCtrlRegs.GPBMUX2.bit.GPIO49 = 0;	//GPIO49 -> F1
	GpioCtrlRegs.GPBDIR.bit.GPIO49 = 0;		//Input

	GpioCtrlRegs.GPBMUX2.bit.GPIO48 = 0;	//GPIO48 -> F2
	GpioCtrlRegs.GPBDIR.bit.GPIO48 = 0;		//Input

	GpioCtrlRegs.GPBMUX2.bit.GPIO58 = 0;	//GPIO58 -> F3
	GpioCtrlRegs.GPBDIR.bit.GPIO58 = 0;		//Input

	GpioCtrlRegs.GPBMUX2.bit.GPIO50 = 1;	//GPIO50 -> CHA
	GpioCtrlRegs.GPBDIR.bit.GPIO50 = 0;		//Input

	GpioCtrlRegs.GPBMUX2.bit.GPIO51 = 1;	//GPIO51 -> CHB
	GpioCtrlRegs.GPBDIR.bit.GPIO51 = 0;		//Input

