Haley212/SMEC_PMSM/User/F28335BSP.c
	GpioCtrlRegs.GPBMUX2.bit.GPIO53 = 1;	//GPIO53 -> CHZ
	GpioCtrlRegs.GPBDIR.bit.GPIO53 = 0;		//Input

	GpioCtrlRegs.GPBCTRL.bit.QUALPRD3 = 75;	// 32 samples
	GpioCtrlRegs.GPBCTRL.bit.QUALPRD2 = 75;
//-------------End OF Encoder-----------------//

// Xint2
	GpioCtrlRegs.GPAMUX2.bit.GPIO26 = 0;
	GpioCtrlRegs.GPADIR.bit.GPIO26 = 0;		//input
	GpioCtrlRegs.GPAQSEL2.bit.GPIO26 = 2;	//6 samples

	GpioIntRegs.GPIOXINT2SEL.bit.GPIOSEL = 26;	//gpio26 as input

	XIntruptRegs.XINT2CR.bit.POLARITY = 1;	//rising
	XIntruptRegs.XINT2CR.bit.ENABLE = 1;

   EDIS;
}

void ConfigureAllEPWM(void){
	EALLOW;
	SysCtrlRegs.PCLKCR0.bit.TBCLKSYNC = 0;//Disable Clock
	EDIS;

	ConfigureEPWMn(&EPwm1Regs);
	ConfigureEPWMn(&EPwm2Regs);
	ConfigureEPWMn(&EPwm3Regs);
	ConfigureEPWMn(&EPwm4Regs);
	ConfigureEPWMn(&EPwm5Regs);
	ConfigureEPWMn(&EPwm6Regs);

    // Interrupt where we will change the Compare Values
    EPwm1Regs.ETSEL.bit.INTSEL = ET_CTR_ZERO;      // Select INT on Zero event
    EPwm1Regs.ETSEL.bit.INTEN = 1;	               // Enable INT
    EPwm1Regs.ETPS.bit.INTPRD = ET_1ST;            // Generate INT on 3rd event

    //trigger SOC
    EPwm1Regs.ETSEL.bit.SOCAEN = 1;        // Enable SOC on A group
    EPwm1Regs.ETSEL.bit.SOCASEL = 1;       // Select SOC from ZERO
    EPwm1Regs.ETPS.bit.SOCAPRD = 1;        // Generate pulse on 1st event

	EALLOW;
	SysCtrlRegs.PCLKCR0.bit.TBCLKSYNC = 1;//Enable Clock
	EDIS;

	/*EPwm1Regs.CMPA.half.CMPA = EPWM_TIMER_TBPRD;
	EPwm2Regs.CMPA.half.CMPA = 0;
	EPwm3Regs.CMPA.half.CMPA = EPWM_TIMER_TBPRD;
	EPwm4Regs.CMPA.half.CMPA = 0;
	EPwm5Regs.CMPA.half.CMPA = EPWM_TIMER_TBPRD;
	EPwm6Regs.CMPA.half.CMPA = 0;*/
}

static void ConfigureEPWMn(volatile struct EPWM_REGS *EPWMn){
	EPWMn->TBPRD = EPWM_TIMER_TBPRD;
	EPWMn->TBPHS.half.TBPHS = 0x0000;
	EPWMn->TBCTR = 0x0000;

	EPWMn->CMPA.half.CMPA = 0;
	EPWMn->CMPB = 0;

	EPWMn->TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;
	EPWMn->TBCTL.bit.PHSEN = TB_DISABLE;
	EPWMn->TBCTL.bit.PRDLD = TB_SHADOW;
	EPWMn->TBCTL.bit.HSPCLKDIV = TB_DIV1;
	EPWMn->TBCTL.bit.CLKDIV = TB_DIV1;

	EPWMn->CMPCTL.bit.SHDWAMODE = CC_SHADOW;
	EPWMn->CMPCTL.bit.SHDWBMODE = CC_SHADOW;
	EPWMn->CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;
	EPWMn->CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;

	EPWMn->AQCTLA.bit.CAU = AQ_SET;		//Set PWM1A on EventA, Up Count
	EPWMn->AQCTLA.bit.CAD = AQ_CLEAR;	//Clear PWM1A on EventA, Down Count
	//EPWMn->AQCTLB.bit.CBU = AQ_SET;
	//EPWMn->AQCTLB.bit.CBD = AQ_CLEAR;

	EPWMn->DBCTL.bit.OUT_MODE = DB_FULL_ENABLE;
	EPWMn->DBCTL.bit.POLSEL = DB_ACTV_HIC;
	EPWMn->DBCTL.bit.IN_MODE = DBA_ALL;
	EPWMn->DBRED = DEAD_TIME;			// Falling Edge Delay = 100 TBCLKs
	EPWMn->DBFED = DEAD_TIME;			// Raising Edge Delay = 100 TBCLKs
}

void SetPWMDutyCycle(unsigned int *Dty){
	EPwm1Regs.CMPA.half.CMPA = Dty[0];
	EPwm2Regs.CMPA.half.CMPA = Dty[1];
	EPwm3Regs.CMPA.half.CMPA = Dty[2];
	EPwm4Regs.CMPA.half.CMPA = Dty[3];
	EPwm5Regs.CMPA.half.CMPA = Dty[4];
	EPwm6Regs.CMPA.half.CMPA = Dty[5];
}

void ConfigureSCI(void){
	EALLOW;
	//GPIO62->SCIRXDC GPIO63->SCITXDC
	//Pull Up
	GpioCtrlRegs.GPBPUD.bit.GPIO62 = 0;
	GpioCtrlRegs.GPBPUD.bit.GPIO63 = 0;
	GpioCtrlRegs.GPBQSEL2.bit.GPIO62 = 3;
	GpioCtrlRegs.GPBMUX2.bit.GPIO62 = 1;
	GpioCtrlRegs.GPBMUX2.bit.GPIO63 = 1;

	ScicRegs.SCICCR.all = 0x0007;   // 1 stop bit, 8 bit, No Parity
	ScicRegs.SCICTL1.all = 0x0003;  // enable TX, RX, internal SCICLK,Disable RX ERR, SLEEP, TXWAKE
	ScicRegs.SCICTL2.bit.TXINTENA = 1; // TX Interrupt Enable
	ScicRegs.SCICTL2.bit.RXBKINTENA = 1;//Rx Interrupt Enable
	//BaudRate = LSPCLK/(BRR+1)/8
	//LSPCLK = SYSOUT/4 (reset default and configurable)
	//BRR = LSPCLK/8*BaudRate - 1
	//115200 = 37.5M / 8 / 115200 -1 = 39
	ScicRegs.SCIHBAUD = 0;
	ScicRegs.SCILBAUD = 39;
	ScicRegs.SCICTL1.all =0x0023;// ReEnable SCI after Reset

	//Enhanced Mode with FIFO
	ScicRegs.SCIFFTX.all = 0xE001;
	//SCI FIFO Enahancements enabled, Depth 16 word,Interrupt Disable
	ScicRegs.SCIFFRX.all = 0x2021;
	//SCI FIFO Rx enabled, Depth 16 word, Interrupt enabled

	PieVectTable.SCIRXINTC = &SCICRXISR;
	PieCtrlRegs.PIEIER8.bit.INTx5 = 1;//Group8 INT5, RX Interrupt
	IER |= M_INT8;

	EDIS;
}

interrupt void SCICRXISR(void){
	unsigned char Recvd;
	unsigned char i;
	if(ScicRegs.SCIFFRX.bit.RXFFINT){//Rx Interrupted Occurred
		Recvd = ScicRegs.SCIRXBUF.all;
		switch(Recvd){
			case 0x0D:for(i=0;i<SCIRxBufferIndex;i++){		//回车
					SCICmdBuffer[i] = SCIRxBuffer[i];
					SCIRxBuffer[i] = 0;
				}
				SCICmdBuffer[SCIRxBufferIndex] = 0;			//后面加上\0
				SCICmdBufferIndex = SCIRxBufferIndex + 1;	//多了\0，Menu响应输入
				SCIRxBufferIndex = 0;
				break;
			case 0x1B:SCICmdBuffer[0] = 0x1B;				//ESC
				SCICmdBufferIndex = 1;
				break;
			case 0x08:SCIRxBufferIndex = 0; 				//backspace
				SCITransmitByte(0x08);
				break;
			default:SCITransmitByte(Recvd);
				SCIRxBuffer[SCIRxBufferIndex] = Recvd;
				SCIRxBufferIndex ++;
				break;
		}
	}
	ScicRegs.SCIFFRX.bit.RXFFINTCLR = 1;//Clear flag
	PieCtrlRegs.PIEACK.all = PIEACK_GROUP8;
}

void SCITransmit(void)
{
//	while(!ScicRegs.SCICTL2.bit.TXRDY);

	if(SciDataInP!=SciDataOutP)
	{
		if(ScicRegs.SCIFFTX.bit.TXFFST<16)
		{
			ScicRegs.SCITXBUF = SciDataBuff[SciDataOutP];
			SciDataOutP=(SciDataOutP+1)%SCIDATABUFF;
		}
	}

}

void SCITransmitByte(unsigned char Buffer){
	while(!ScicRegs.SCICTL2.bit.TXRDY);
	ScicRegs.SCITXBUF = Buffer;
}

void ConfigureADC(void){
	// Configure ADC Using Sequential Sampling Mode
    AdcRegs.ADCTRL1.bit.SEQ_CASC = 0x1; // Setup cascaded sequencer mode
    AdcRegs.ADCTRL1.bit.ACQ_PS = 15;//16 cycle sample and hold
    AdcRegs.ADCTRL1.bit.CPS = 1;
    AdcRegs.ADCTRL3.bit.ADCCLKPS = 1;
    AdcRegs.ADCMAXCONV.all = 0x000F;    // 16 CONV
    AdcRegs.ADCCHSELSEQ1.bit.CONV00 = 0x0;
    AdcRegs.ADCCHSELSEQ1.bit.CONV01 = 0x1;
    AdcRegs.ADCCHSELSEQ1.bit.CONV02 = 0x2;
    AdcRegs.ADCCHSELSEQ1.bit.CONV03 = 0x3;
    AdcRegs.ADCCHSELSEQ2.bit.CONV04 = 0x4;
    AdcRegs.ADCCHSELSEQ2.bit.CONV05 = 0x5;
    AdcRegs.ADCCHSELSEQ2.bit.CONV06 = 0x6;
    AdcRegs.ADCCHSELSEQ2.bit.CONV07 = 0x7;
    AdcRegs.ADCCHSELSEQ3.bit.CONV08 = 0x8;
    AdcRegs.ADCCHSELSEQ3.bit.CONV09 = 0x9;
    AdcRegs.ADCCHSELSEQ3.bit.CONV10 = 0xA;
    AdcRegs.ADCCHSELSEQ3.bit.CONV11 = 0xB;
    AdcRegs.ADCCHSELSEQ4.bit.CONV12 = 0xC;
    AdcRegs.ADCCHSELSEQ4.bit.CONV13 = 0xD;
    AdcRegs.ADCCHSELSEQ4.bit.CONV14 = 0xE;
    AdcRegs.ADCCHSELSEQ4.bit.CONV15 = 0xF;
//    AdcRegs.ADCTRL2.bit.EPWM_SOCA_SEQ1 = 1;// Started by ePWMx SOCA trigger
//    AdcRegs.ADCTRL2.bit.INT_ENA_SEQ1 = 1;  // Enable SEQ1 interrupt (every EOS)
    AdcRegs.ADCTRL2.bit.EXT_SOC_SEQ1 = 1;// started by Xint2
    AdcRegs.ADCTRL2.bit.INT_ENA_SEQ1 = 1;// enable SEQ1 interrupt
}

/*******************************Encoder*************************************/
void ConfigureEQEP(void){
	#if (CPU_FRQ_150MHZ)
	  EQep1Regs.QUPRD=1500000;			// 输出100Hz中断，每10ms锁定位置信号
	#endif
	#if (CPU_FRQ_100MHZ)
	  EQep1Regs.QUPRD=1000000;			//
	#endif

	EQep1Regs.QDECCTL.bit.QSRC=00;		// 正交编码模式

