Haley212/SMEC_PMSM/User/F28335BSP.c
	EQep1Regs.QEPCTL.bit.FREE_SOFT=2;
	EQep1Regs.QEPCTL.bit.PCRM=00;		// PCRM=00 mode - QPOSCNT reset on index event
	EQep1Regs.QEPCTL.bit.UTE=1; 		// Unit Timeout Enable
	EQep1Regs.QEPCTL.bit.QCLM=1; 		// Latch on unit time out
	EQep1Regs.QPOSMAX= (unsigned int)32767;
	EQep1Regs.QEPCTL.bit.QPEN=1; 		// QEP enable

	EQep1Regs.QCAPCTL.bit.UPPS=5;   	// 1/32 for unit position
	EQep1Regs.QCAPCTL.bit.CCPS=7;		// 1/128 for CAP clock , 150M/128
	EQep1Regs.QCAPCTL.bit.CEN=1; 		// QEP Capture Enable
}
/***************************************************************************/

/***************************************************************************/
/********************************FPGA***************************************/
volatile struct Fpga_Regs FpgaRegs;
#pragma DATA_SECTION(FpgaRegs,"fpga_ram");
// 内存分配
// ---ZONE0---保留
// ---ZONE6---FPGA交互
// ---ZONE7---保留

void ConfigureXintf(void)
{

    EALLOW;

    XintfRegs.XRESET.bit.XHARDRESET = 1;	// reset xintf


    XintfRegs.XINTCNF2.bit.XTIMCLK = 1;	  //XTIMCLK=SYSCLKOUT/2
    XintfRegs.XINTCNF2.bit.WRBUFF = 0;	  //NO Buffer
    XintfRegs.XINTCNF2.bit.CLKOFF = 1;    // XCLKOUT is disabled
    XintfRegs.XINTCNF2.bit.CLKMODE = 1;   //XCLKOUT=XTIMCLK/2=SYSCLKOUT/4=37.5M@150MHz

    // Zone 0------------------------------------
    XintfRegs.XTIMING0.bit.XWRLEAD = 3;
    XintfRegs.XTIMING0.bit.XWRACTIVE = 7;
    XintfRegs.XTIMING0.bit.XWRTRAIL = 3;
    // Zone read timing
    XintfRegs.XTIMING0.bit.XRDLEAD = 3;
    XintfRegs.XTIMING0.bit.XRDACTIVE = 7;
    XintfRegs.XTIMING0.bit.XRDTRAIL = 3;

    XintfRegs.XTIMING0.bit.X2TIMING = 1;   //double all Zone read/write lead/active/trail timing
    XintfRegs.XTIMING0.bit.USEREADY = 0;   // Zone will sample XREADY signal
    XintfRegs.XTIMING0.bit.READYMODE = 1;  // sample asynchronous

    XintfRegs.XTIMING0.bit.XSIZE = 3;		//Zone0 Width = 16bits

    // Zone 6------------------------------------

    XintfRegs.XTIMING6.bit.XWRLEAD = 1;
    XintfRegs.XTIMING6.bit.XWRACTIVE = 3;
    XintfRegs.XTIMING6.bit.XWRTRAIL = 3;

    XintfRegs.XTIMING6.bit.XRDLEAD = 1;
    XintfRegs.XTIMING6.bit.XRDACTIVE = 2;
    XintfRegs.XTIMING6.bit.XRDTRAIL = 1;


    XintfRegs.XTIMING6.bit.X2TIMING = 1;   // double all Zone read/write lead/active/trail timing
    XintfRegs.XTIMING6.bit.USEREADY = 0;   // Zone will not sample XREADY signal
    XintfRegs.XTIMING6.bit.READYMODE = 1;  // sample asynchronous

    XintfRegs.XTIMING6.bit.XSIZE = 3;  //Width=16bit

    // Zone 7------------------------------------

    XintfRegs.XTIMING7.bit.XWRLEAD = 1;		//WR Lead
    XintfRegs.XTIMING7.bit.XWRACTIVE = 7;	//WR Active
    XintfRegs.XTIMING7.bit.XWRTRAIL = 1;	//WR Trail

    XintfRegs.XTIMING7.bit.XRDLEAD = 1;		//RD Lead
    XintfRegs.XTIMING7.bit.XRDACTIVE = 3;	//RD Active
    XintfRegs.XTIMING7.bit.XRDTRAIL = 2;	//RD Trail

    XintfRegs.XTIMING7.bit.X2TIMING = 1;    // double all Zone read/write lead/active/trail timing
    XintfRegs.XTIMING7.bit.USEREADY = 0;	// Zone will not sample XREADY signal
    XintfRegs.XTIMING7.bit.READYMODE = 1;   // sample asynchronous

    XintfRegs.XTIMING7.bit.XSIZE = 3;		//Width=16bit

    XintfRegs.XBANK.bit.BANK = 7;
    XintfRegs.XBANK.bit.BCYC = 2;
    EDIS;

   asm(" RPT #15 || NOP");

}

void Enable_FPGA(void)
{
	GpioDataRegs.GPBCLEAR.bit.GPIO61 = 1;   //PROG_B pin of FPGA = 0
	DELAY_US(100);							//Delay 1ms 500ns is enough in fact
	GpioDataRegs.GPBSET.bit.GPIO61 = 1;
	DELAY_US(500000); 						//Waiting for FPGA to start -- 0.5s
}


void Reset_FPGA(void)
{
	GpioDataRegs.GPACLEAR.bit.GPIO16 = 1;
	DELAY_US(10);
}

void Stop_FPGA(void)
{
	GpioDataRegs.GPBSET.bit.GPIO34 = 1;
}

void Start_FPGA(void)
{
	GpioDataRegs.GPBCLEAR.bit.GPIO34 = 1;
}

//------------读Checkvalue1和2 不对就说明有问题----
int CheckFpga(void)
{
	if(FpgaRegs.CheckValue1 == 0xaaaa && FpgaRegs.CheckValue2 == 0x5555)
		return FpgaRight;
	else
		return FpgaError;
}

//-------------检查软件版本---------
int CheckSoftwareVersion(void)
{
	int checktemp;

	checktemp = Fpga_Software_Version;

	if(FpgaRegs.FpgaSoftwareVersion == checktemp)
		return FpgaRight;
	else
		return FpgaError;
}

void DelayMs(unsigned int T){
	volatile unsigned int i,j,k;
	for(i=0;i<T;i++){
		for(j=0;j<5000;j++){
			k++;
		}
	}
}
